src/cf/Documents/ЛУРВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛУРВ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтчетЗаДень</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Окончание</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тикет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Тикеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаТаймлог</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длительность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФиксированнаяДлительность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ЛУРВ/Ext/ObjectModule.bsl
// https://its.1c.ru/db/v8std#content:455:hdoc
// Документ «Лист учета рабочего времени» (ЛУРВ).
// Серверная логика по UC-00 (Arc/Таймтрекинг.md): создание строк (шаги 3, 10),
// пересчёты при правке времён и длительности (шаги 4–8), сдвиг строк (шаги 11–12),
// фиксация окончания дня (шаг 13), автопродление (шаг 14), удаление (шаг 15),
// контроль дубля документа на дату (шаг 2), начало дня (UC-01), группировка
// строк для синхронизации (UC-07, подготовка).

// Адаптация модели плана к текущей конфигурации:
//   ВремяНачалаДня/ВремяОкончанияДня  -> НачалоРаботы / ОкончаниеРаботы (шапка)
//   Задача                           -> Тикет (Справочник.Тикеты)
//   Комментарий                      -> Описание
//   ИдентификаторЗаписиВремени       -> СсылкаНаТаймлог
//   Состояние документа выводимое (UC-00/UC-09): «Активен» — начало работы
//     заполнено, а окончание рабочего дня нет; «Завершён» — окончание
//     рабочего дня заполнено; иначе «Черновик».

#Область ПрограммныйИнтерфейс

// Создаёт новую строку табличной части по UC-00 шаги 3 и 10.
// Если ТЧ пуста — строка начинается с даты начала дня (шаг 3).
// Если вставляем после строки — начало новой равно окончанию строки,
// после которой вставляем, длительность нулевая (шаг 10).
// При добавлении в конец незавершённая последняя строка фиксируется
// переданным моментом (UC-03: переключение задачи).
//
// Параметры:
//   Тикет           - СправочникСсылка.Тикеты - задача строки.
//   МоментФиксации  - Дата - момент фиксации окончания предыдущей строки
//                     (по умолчанию ТекущаяДата()).
//   ИндексВставки   - Число - индекс строки, ПОСЛЕ которой вставляем
//                     (по умолчанию Неопределено — вставка в конец).
//
// Возвращаемое значение:
//   СтрокаТабличнойЧасти - созданная строка.
//
Функция СоздатьСтроку(Знач Тикет = Неопределено,
	Знач МоментФиксации = Неопределено,
	Знач ИндексВставки = Неопределено) Экспорт

	Если МоментФиксации = Неопределено Тогда
		МоментФиксации = ТекущаяДата();
	КонецЕсли;

	Если ОтчетЗаДень.Количество() = 0 Тогда
		ВремяНачала = НачалоРаботы;
		Если ПустаяДата(ВремяНачала) Тогда
			ВремяНачала = НачалоДня(МоментФиксации) + ВремяНачалаРабочегоДня();
		КонецЕсли;
	ИначеЕсли ИндексВставки <> Неопределено Тогда
		// Шаг 10 UC-00: начало = окончание строки, после которой вставляем.
		ВремяНачала = ОтчетЗаДень[ИндексВставки].Окончание;
		ВставкаВСередину = Истина;
	Иначе
		// Добавление в конец: незавершённая последняя строка фиксируется.
		ПоследняяСтрока = ОтчетЗаДень[ОтчетЗаДень.Количество() - 1];
		Если НЕ СтрокаЗафиксирована(ПоследняяСтрока) Тогда
			ПоследняяСтрока.Окончание = МоментФиксации;
			ПересчитатьДлительностьСтроки(ПоследняяСтрока);
		КонецЕсли;
		ВремяНачала = ПоследняяСтрока.Окончание;
	КонецЕсли;

	Если ВставкаВСередину Тогда
		НоваяСтрока = ОтчетЗаДень.Вставить(ИндексВставки + 1);
	Иначе
		НоваяСтрока = ОтчетЗаДень.Добавить();
	КонецЕсли;

	НоваяСтрока.Тикет = Тикет;
	НоваяСтрока.Начало = ВремяНачала;
	НоваяСтрока.Окончание = ВремяНачала;
	НоваяСтрока.Длительность = 0;

	// Каскадный пересчёт хвоста при вставке в середину.
	Если ВставкаВСередину Тогда
		ПересчитатьВременаОт(ИндексВставки + 1);
	КонецЕсли;

	Возврат НоваяСтрока;

КонецФункции

// Автопродление последней строки (UC-00 шаг 14): пока дата окончания
// рабочего дня не заполнена, корректирует время окончания последней строки
// с длительностью от момента начала до переданного момента.
//
// Параметры:
//   Момент - Дата - момент автопродления (по умолчанию ТекущаяДата()).
//
Процедура АвтопродлитьПоследнююСтроку(Знач Момент = Неопределено) Экспорт

	Если ЗначениеЗаполнено(ОкончаниеРаботы) Тогда
		Возврат;
	КонецЕсли;

	Если ОтчетЗаДень.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Если Момент = Неопределено Тогда
		Момент = ТекущаяДата();
	КонецЕсли;

	ПоследняяСтрока = ОтчетЗаДень[ОтчетЗаДень.Количество() - 1];
	ПоследняяСтрока.Окончание = Момент;
	ПересчитатьДлительностьСтроки(ПоследняяСтрока);

КонецПроцедуры

// Завершение рабочего дня (UC-00 шаг 13): фиксирует окончание последней
// строки моментом завершения, заполняет время окончания работы и переводит
// документ в состояние «Завершён». Повторный вызов ничего не меняет.
//
// Параметры:
//   Момент - Дата - момент завершения дня (по умолчанию ТекущаяДата()).
//
// Возвращаемое значение:
//   Булево - Истина, если день завершён впервые; Ложь, если уже завершён.
//
Функция ЗавершитьДень(Знач Момент = Неопределено) Экспорт

	Если ЗначениеЗаполнено(ОкончаниеРаботы) Тогда
		Возврат Ложь;
	КонецЕсли;

	Если Момент = Неопределено Тогда
		Момент = ТекущаяДата();
	КонецЕсли;

	Если ОтчетЗаДень.Количество() > 0 Тогда
		ПоследняяСтрока = ОтчетЗаДень[ОтчетЗаДень.Количество() - 1];
		ПоследняяСтрока.Окончание = Момент;
		ПересчитатьДлительностьСтроки(ПоследняяСтрока);
	КонецЕсли;

	ОкончаниеРаботы = Момент;

	Возврат Истина;

КонецФункции

// Группирует последовательные строки с одинаковым тикетом для передачи
// в ФасадИнтеграции (UC-07 / архитектура, п.4.2): для каждой группы —
// суммарная длительность и уникальные непустые комментарии через «; ».
//
// Возвращаемое значение:
//   Массив - элементы Структура (Тикет, Длительность, Комментарий).
//
Функция СгруппироватьСтрокиДляСинхронизации() Экспорт

	Группы = Новый Массив;

	Если ОтчетЗаДень.Количество() = 0 Тогда
		Возврат Группы;
	КонецЕсли;

	ТекущийТикет = Неопределено;
	ДлительностьГруппы = 0;
	Комментарии = Новый Соответствие;

	Для Каждого СтрокаТЧ Из ОтчетЗаДень Цикл

		Если СтрокаТЧ.Тикет <> ТекущийТикет Тогда
			Если ТекущийТикет <> Неопределено Тогда
				Группы.Добавить(НоваяГруппа(
					ТекущийТикет, ДлительностьГруппы, Комментарии));
			КонецЕсли;
			ТекущийТикет = СтрокаТЧ.Тикет;
			ДлительностьГруппы = 0;
			Комментарии = Новый Соответствие;
		КонецЕсли;

		ДлительностьГруппы = ДлительностьГруппы + ДлительностьСтрокиВСекундах(СтрокаТЧ);

		Если НЕ ПустаяСтрока(СтрокаТЧ.Описание) И Комментарии.Получить(СтрокаТЧ.Описание) <> Истина Тогда
			Комментарии.Вставить(СтрокаТЧ.Описание, Истина);
		КонецЕсли;

	КонецЦикла;

	Если ТекущийТикет <> Неопределено Тогда
		Группы.Добавить(НоваяГруппа(ТекущийТикет, ДлительностьГруппы, Комментарии));
	КонецЕсли;

	Возврат Группы;

КонецФункции

// Начало дня (UC-01, шаги 1–3 UC-00): для документа в состоянии «Черновик»
// заполняет начало рабочего дня текущей датой, добавляет первую строку
// (если табличная часть пуста) и переводит документ в состояние «Активен».
//
// Параметры:
//   ДатаРаботы        - Дата - день, который начинается (по умолчанию ТекущаяДата()).
//   ЗадачаПоУмолчанию - СправочникСсылка.Тикеты - задача первой строки.
//
// Возвращаемое значение:
//   Булево - Истина.
//
Функция НачатьДень(Знач ДатаРаботы = Неопределено,
	Знач ЗадачаПоУмолчанию = Неопределено) Экспорт

	Если ДатаРаботы = Неопределено Тогда
		ДатаРаботы = ТекущаяДата();
	КонецЕсли;

	Если ПустаяДата(НачалоРаботы) Тогда
		НачалоРаботы = НачалоДня(ДатаРаботы) + ВремяНачалаРабочегоДня();
	КонецЕсли;

	Если ОтчетЗаДень.Количество() = 0 Тогда
		СоздатьСтроку(ЗадачаПоУмолчанию);
	КонецЕсли;

	Возврат Истина;

КонецФункции

// Контроль дубля документа на дату (UC-00 шаг 2): есть ли другой документ
// ЛУРВ с началом работы в тот же день.
//
// Возвращаемое значение:
//   Булево - Истина, если на дату начала существует другой документ.
//
Функция ЕстьДругойДокументНаДату() Экспорт

	Если ПустаяДата(НачалоРаботы) Тогда
		Возврат Ложь;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛУРВ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЛУРВ КАК ЛУРВ
	|ГДЕ
	|	ЛУРВ.НачалоРаботы >= &НачалоДня
	|	И ЛУРВ.НачалоРаботы < &СледующийДень
	|	И ЛУРВ.Ссылка <> &ТекущийДокумент
	|	И НЕ ЛУРВ.ПометкаУдаления";

	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(НачалоРаботы));
	Запрос.УстановитьПараметр("СледующийДень", КонецДня(НачалоРаботы) + ОднаСекунда());
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);

	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции

// Перемещение строки вверх (UC-00 шаг 12): строки меняются местами,
// длительности остаются, времена пересчитываются как непрерывная цепочка.
//
// Параметры:
//   Индекс - Число - индекс перемещаемой строки.
//
// Возвращаемое значение:
//   Булево - Истина, если строки перемещены; Ложь — первая строка не движется.
//
Функция ПереместитьСтрокуВверхНаСервере(Знач Индекс) Экспорт

	Если Индекс <= 0 Тогда
		Возврат Ложь;
	КонецЕсли;

	ПоменятьСтрокиМестами(Индекс - 1, Индекс);
	ПересчитатьВременаОт(Индекс - 1);

	Возврат Истина;

КонецФункции

// Перемещение строки вниз (UC-00 шаг 11): строки меняются местами,
// длительности остаются, времена пересчитываются как непрерывная цепочка.
//
// Параметры:
//   Индекс - Число - индекс перемещаемой строки.
//
// Возвращаемое значение:
//   Булево - Истина, если строки перемещены; Ложь — последняя строка не движется.
//
Функция ПереместитьСтрокуВнизНаСервере(Знач Индекс) Экспорт

	Если Индекс >= ОтчетЗаДень.Количество() - 1 Тогда
		Возврат Ложь;
	КонецЕсли;

	ПоменятьСтрокиМестами(Индекс, Индекс + 1);
	ПересчитатьВременаОт(Индекс);

	Возврат Истина;

КонецФункции

// Пересчёт при смене даты начала строки (UC-00 шаги 5–6).
// Если строка первая — меняется дата начала дня (шаг 5).
// Иначе меняется дата окончания у предыдущей строки (шаг 5).
// Далее пересчёт по шагу 6: для фиксированной длительности меняется дата
// окончания и дата начала следующей строки; для обычной, если дата окончания
// становится меньше даты начала, даты приравниваются, меняется длительность,
// дата начала следующей и её пересчёт.
//
// Параметры:
//   Индекс - Число - индекс изменённой строки.
//
Процедура ОбработатьИзменениеНачалаСтрокиНаСервере(Знач Индекс) Экспорт

	Если Индекс < 0 Или Индекс >= ОтчетЗаДень.Количество() Тогда
		Возврат;
	КонецЕсли;

	СтрокаТЧ = ОтчетЗаДень[Индекс];

	Если Индекс = 0 Тогда
		// Шаг 5: изменение начала первой строки меняет дату начала дня.
		Если НЕ ПустаяДата(СтрокаТЧ.Начало) Тогда
			НачалоРаботы = НачалоДня(СтрокаТЧ.Начало) + ВремяНачалаРабочегоДня();
		КонецЕсли;
	Иначе
		// Шаг 5: меняется дата окончания у предыдущей строки.
		ПредыдущаяСтрока = ОтчетЗаДень[Индекс - 1];
		ПредыдущаяСтрока.Окончание = СтрокаТЧ.Начало;
		ПересчитатьДлительностьСтроки(ПредыдущаяСтрока);
	КонецЕсли;

	ПересчитатьПриИзмененииНачала(Индекс);

КонецПроцедуры

// Пересчёт при смене даты окончания строки (UC-00 шаг 7).
// Для строки с фиксированной длительностью меняется дата начала
// (сохранение длительности) и запускается пересчёт по смене даты начала.
// Для обычной, если дата начала становится больше даты окончания,
// даты приравниваются, запускается пересчёт по смене даты начала,
// меняется длительность.
//
// Параметры:
//   Индекс - Число - индекс изменённой строки.
//
Процедура ОбработатьИзменениеОкончанияСтрокиНаСервере(Знач Индекс) Экспорт

	Если Индекс < 0 Или Индекс >= ОтчетЗаДень.Количество() Тогда
		Возврат;
	КонецЕсли;

	СтрокаТЧ = ОтчетЗаДень[Индекс];

	Если ЭтоСтрокаСФиксированнойДлительностью(СтрокаТЧ) Тогда
		// Шаг 7.1 UC-00: меняется дата начала (длительность сохраняется),
		// запускается пересчёт по смене даты начала.
		СтрокаТЧ.Начало = СтрокаТЧ.Окончание - СтрокаТЧ.Длительность;
		ОбработатьИзменениеНачалаСтрокиНаСервере(Индекс);
	Иначе
		// Шаг 7.2 UC-00: обычная строка.
		Если СтрокаТЧ.Начало > СтрокаТЧ.Окончание Тогда
			// Дата начала стала больше даты окончания — приравниваем и
			// запускаем пересчёт по изменению даты начала.
			СтрокаТЧ.Начало = СтрокаТЧ.Окончание;
			ПересчитатьДлительностьСтроки(СтрокаТЧ);
			ОбработатьИзменениеНачалаСтрокиНаСервере(Индекс);
		Иначе
			// Нормальный случай: меняется длительность; следующая строка
			// сдвигается на новое окончание (непрерывность цепочки).
			ПересчитатьДлительностьСтроки(СтрокаТЧ);
			СдвинутьХвост(Индекс + 1);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Пересчёт при смене длительности строки (UC-00 шаг 8): меняется дата
// окончания = дата начала + длительность; пересчёт хвоста; если строка
// была последней и конец дня заполнен — меняется конец дня.
//
// Параметры:
//   Индекс - Число - индекс изменённой строки.
//
Процедура ОбработатьИзменениеДлительностиСтрокиНаСервере(Знач Индекс) Экспорт

	Если Индекс < 0 Или Индекс >= ОтчетЗаДень.Количество() Тогда
		Возврат;
	КонецЕсли;

	СтрокаТЧ = ОтчетЗаДень[Индекс];
	СтрокаТЧ.Окончание = СтрокаТЧ.Начало + СтрокаТЧ.Длительность;

	Если Индекс = ОтчетЗаДень.Количество() - 1 Тогда
		// Строка была последней.
		Если ЗначениеЗаполнено(ОкончаниеРаботы) Тогда
			ОкончаниеРаботы = СтрокаТЧ.Окончание;
		КонецЕсли;
	Иначе
		ПересчитатьВременаОт(Индекс + 1);
	КонецЕсли;

КонецПроцедуры

// Удаление строки (UC-00 шаг 15): время начала следующей строки становится
// временем начала удаляемой; если следующая обычная — меняется длительность,
// если фиксированная — каскадный пересчёт вниз. Если у удаляемой строки была
// запись времени внешней системы, она переносится в первую строку таблицы
// с датой начала = дата окончания, нулевой длительностью и комментарием
// «к удалению».
//
// Параметры:
//   Индекс - Число - индекс строки, стоящей на месте удалённой (строка уже удалена).
//   ДанныеУдаленнойСтроки - Структура - Начало/Окончание/Тикет/СсылкаНаТаймлог
//     удалённой строки (по умолчанию Неопределено).
//
Процедура ОбработатьУдалениеСтрокиНаСервере(Знач Индекс, Знач ДанныеУдаленнойСтроки = Неопределено) Экспорт

	Если ОтчетЗаДень.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Если Индекс >= ОтчетЗаДень.Количество() Тогда
		Индекс = ОтчетЗаДень.Количество() - 1;
	КонецЕсли;

	// Шаг 15 UC-00: время начала следующей строки становится временем начала удаляемой.
	Если ДанныеУдаленнойСтроки <> Неопределено И НЕ ПустаяДата(ДанныеУдаленнойСтроки.Начало) Тогда
		ОтчетЗаДень[Индекс].Начало = ДанныеУдаленнойСтроки.Начало;
	КонецЕсли;

	// Если у удаляемой строки была запись внешней системы — переносим её
	// в первую строку таблицы (шаг 15 UC-00).
	Если ДанныеУдаленнойСтроки <> Неопределено И НЕ ПустаяСтрока(ДанныеУдаленнойСтроки.СсылкаНаТаймлог) Тогда
		НоваяСтрока = ОтчетЗаДень.Вставить(0);
		НоваяСтрока.Тикет = ДанныеУдаленнойСтроки.Тикет;
		НоваяСтрока.СсылкаНаТаймлог = ДанныеУдаленнойСтроки.СсылкаНаТаймлог;
		НоваяСтрока.Начало = ДанныеУдаленнойСтроки.Окончание;
		НоваяСтрока.Окончание = ДанныеУдаленнойСтроки.Окончание;
		НоваяСтрока.Длительность = 0;
		НоваяСтрока.Описание = "к удалению";
		Индекс = Индекс + 1;
	КонецЕсли;

	СтрокаТЧ = ОтчетЗаДень[Индекс];

	Если ЭтоСтрокаСФиксированнойДлительностью(СтрокаТЧ) Тогда
		// Каскадный пересчёт вниз: длительность сохраняется.
		ПересчитатьВременаОт(Индекс);
	Иначе
		// Обычная строка: длительность пересчитана по новым началу/окончанию.
		ПересчитатьДлительностьСтроки(СтрокаТЧ);
	КонецЕсли;

КонецПроцедуры

// Статус синхронизации строки (UC-00 шаг 9 / UC-09):
// зелёный — синхронизировано и актуально; жёлтый — требуется синхронизация;
// серый — не синхронизируется (нет интеграции).
//
// Параметры:
//   СтрокаТЧ               - СтрокаТабличнойЧасти - строка документа.
//   ДанныеКэшаАктуальны    - Булево - совпадают ли данные строки с кэшем
//                            внешней системы (по умолчанию Истина).
//
// Возвращаемое значение:
//   Строка - «Синхронизировано» / «Требует синхронизации» / «Не синхронизируется».
//
Функция СтатусСинхронизацииСтроки(СтрокаТЧ, Знач ДанныеКэшаАктуальны = Истина) Экспорт

	Возврат УчетРабочегоВремени.СтатусСинхронизацииСтроки(
		СтрокаТЧ.Тикет, СтрокаТЧ.СсылкаНаТаймлог, ДанныеКэшаАктуальны);

КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// UC-00 шаг 2: при наличии другого документа на дату документ не проводится.
	Если ЕстьДругойДокументНаДату() Тогда
		Отказ = Истина;
		Сообщение = СтрШаблон(
			НСтр("ru = 'На дату %1 уже существует другой документ «Лист учета рабочего времени».'"),
			Формат(НачалоРаботы, "ДФ=dd.MM.yyyy"));
		ОбщегоНазначения.СообщитьПользователю(Сообщение);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

// Признак строки с фиксированной длительностью: у строки есть запись времени
// внешней системы (идентификатор заполнен) — её длительность не пересчитывается
// автоматически, а сохраняется при пересчётах (UC-00 шаги 6–8, 15; п.16.2).
Функция ЭтоСтрокаСФиксированнойДлительностью(СтрокаТЧ)

	Возврат НЕ ПустаяСтрока(СтрокаТЧ.СсылкаНаТаймлог);

КонецФункции

// Пересчёт строки по шагу 6 UC-00 после смены её даты начала.
Процедура ПересчитатьПриИзмененииНачала(Знач Индекс)

	Если Индекс < 0 Или Индекс >= ОтчетЗаДень.Количество() Тогда
		Возврат;
	КонецЕсли;

	СтрокаТЧ = ОтчетЗаДень[Индекс];

	Если ЭтоСтрокаСФиксированнойДлительностью(СтрокаТЧ) Тогда
		// Шаг 6.1: фиксированная длительность — меняется дата окончания,
		// меняется дата начала следующей строки (каскад).
		СтрокаТЧ.Окончание = СтрокаТЧ.Начало + СтрокаТЧ.Длительность;
		СдвинутьХвост(Индекс + 1);
	Иначе
		// Шаг 6.2: обычная строка — если дата окончания меньше даты начала,
		// приравниваем; меняется длительность, дата начала следующей.
		Если СтрокаТЧ.Окончание < СтрокаТЧ.Начало Тогда
			СтрокаТЧ.Окончание = СтрокаТЧ.Начало;
		КонецЕсли;
		ПересчитатьДлительностьСтроки(СтрокаТЧ);
		СдвинутьХвост(Индекс + 1);
	КонецЕсли;

КонецПроцедуры

// Переносит начало следующей строки на окончание предыдущей и пересчитывает
// цепочку до конца с сохранением длительностей.
Процедура СдвинутьХвост(Знач Индекс)

	Если Индекс < 0 Или Индекс >= ОтчетЗаДень.Количество() Тогда
		Возврат;
	КонецЕсли;

	ОтчетЗаДень[Индекс].Начало = ОтчетЗаДень[Индекс - 1].Окончание;
	ПересчитатьВременаОт(Индекс);

КонецПроцедуры

// Пересчитывает времена строк от индекса до конца как непрерывную цепочку:
// каждая следующая строка начинается с окончания предыдущей, длительности
// сохраняются.
Процедура ПересчитатьВременаОт(Знач Индекс)

	Если Индекс < 0 Или Индекс >= ОтчетЗаДень.Количество() Тогда
		Возврат;
	КонецЕсли;

	Для НомерСтроки = Индекс По ОтчетЗаДень.Количество() - 1 Цикл
		СтрокаТЧ = ОтчетЗаДень[НомерСтроки];
		Если НомерСтроки > 0 Тогда
			СтрокаТЧ.Начало = ОтчетЗаДень[НомерСтроки - 1].Окончание;
		КонецЕсли;
		СтрокаТЧ.Окончание = СтрокаТЧ.Начало + СтрокаТЧ.Длительность;
	КонецЦикла;

КонецПроцедуры

// Обменивает логическое содержимое двух строк (тикет, описание, ссылку,
// длительность), сохраняя времена у позиций (UC-00 шаги 11–12).
Процедура ПоменятьСтрокиМестами(Знач ИндексПервая, Знач ИндексВторая)

	Первая = ОтчетЗаДень[ИндексПервая];
	Вторая = ОтчетЗаДень[ИндексВторая];

	Тикет = Первая.Тикет;
	Описание = Первая.Описание;
	СсылкаНаТаймлог = Первая.СсылкаНаТаймлог;
	Длительность = Первая.Длительность;

	Первая.Тикет = Вторая.Тикет;
	Первая.Описание = Вторая.Описание;
	Первая.СсылкаНаТаймлог = Вторая.СсылкаНаТаймлог;
	Первая.Длительность = Вторая.Длительность;

	Вторая.Тикет = Тикет;
	Вторая.Описание = Описание;
	Вторая.СсылкаНаТаймлог = СсылкаНаТаймлог;
	Вторая.Длительность = Длительность;

КонецПроцедуры

Функция СтрокаЗафиксирована(СтрокаТЧ)

	Возврат НЕ ПустаяДата(СтрокаТЧ.Окончание) И СтрокаТЧ.Окончание > СтрокаТЧ.Начало;

КонецФункции

Функция ДлительностьСтрокиВСекундах(СтрокаТЧ)

	Если ПустаяДата(СтрокаТЧ.Начало) Или ПустаяДата(СтрокаТЧ.Окончание) Тогда
		Возврат 0;
	КонецЕсли;

	Если СтрокаТЧ.Окончание <= СтрокаТЧ.Начало Тогда
		Возврат 0;
	КонецЕсли;

	Возврат (СтрокаТЧ.Окончание - СтрокаТЧ.Начало);

КонецФункции

Процедура ПересчитатьДлительностьСтроки(СтрокаТЧ)

	СтрокаТЧ.Длительность = ДлительностьСтрокиВСекундах(СтрокаТЧ);

КонецПроцедуры

Функция ВремяНачалаРабочегоДня()

	// 09:00 по умолчанию.
	Возврат 9 * 60 * 60;

КонецФункции

Функция ОднаСекунда()

	Возврат 1;

КонецФункции

Функция НоваяГруппа(Тикет, Длительность, Комментарии)

	КомментарииМассив = Новый Массив;
	Для Каждого КлючЗначение Из Комментарии Цикл
		КомментарииМассив.Добавить(КлючЗначение.Ключ);
	КонецЦикла;

	Группа = Новый Структура(
		"Тикет, Длительность, Комментарий",
		Тикет,
		Длительность,
		СтрСоединить(КомментарииМассив, "; "));

	Возврат Группа;

КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
